import {Card} from "@/class/card";

export class CardManager {
    static cardList = [

        new Card('Изабель ',
            'Изабель (ориг. Isabel) – героиня фракции Орден Порядка, одна из центральных персонажей игры Heroes of Might and Magic V и её дополнений.\n' +
            '\n' +
            'Рыцарь, невеста императора Николаса, формально занявшая трон после его смерти, и ставшая последней правительницей Империи. Ещё при рождении была отмечена архидемоном Кха-Белехом как будущая мать Тёмного Мессии – Сарета.',
            'У неё решительный и волевой характер. Её мужество проявляется в попытке помочь любимому, а стальной характер в требовании называть её королевой. Но в то же время она вынуждена постоянно искать одобрения влиятельных людей, таких как Годрик и Маркел, и очень доверчива: Изабель с лёгкостью поверила Маркелу. Практически полное отсутствие участия родителей в воспитании дочери привело к тому, что её настроение в основном меняется от капризов до холодного недовольства.',
            'Крепкая, но не лишённая в то же время женственности и привлекательности. Её внутренняя сила видна каждому, и приблизиться к Изабель осмелится не всякий. Она обладает холодной, но завораживающей грацией. У девушки светлая кожа, резкие черты лица, высокий лоб, каштановые волосы, ниспадающие до плеч, и зелёные глаза.',
        ),

        new Card('Раилаг',
            'Раилаг (ориг. Raelag), также известный как Аграил или Аграэль (ориг. Agrael) — герой фракций Лига Теней и Инферно в играх Heroes of Might and Magic V, Might and Magic Heroes VI и Might and Magic Heroes VII, один из самых узнаваемых героев Асхана.',
            'Прошлое Раилага покрыто мраком. И хотя он последователен и беспощаден в битве, его планы и тактика держатся в таком же секрете, как и личная история. Поскольку он часто предугадывает действия соперников, последние колеблются при принятии решений, сойдясь с ним в сражении.',
            'У Раилага длинные иссиня-чёрные волосы, фиолетовые глаза и белая кожа. Он довольно красив, несмотря на мрачность во внешности.'
            ),

        new Card(
            'Николас ',
            'Николас (англ. Nicolai) — один из ключевых персонажей игры Heroes of Might and Magic V, император Священной Империи Грифона, впоследствии ставший вампиром и слугой Маркела.',
            'Для Николаса королевство значит больше, чем кто-либо живущий в нём, и сохранение его он считает своим несомненным долгом. Королю пришлось примерить роль слуги, когда он стал пешкой в руках Маркела.',
            'Блондин в доспехах'
        ),

        new Card(
            'Годрик',
            'Годрик по праву считается образцом рыцаря и примером для подражания. Безупречная служба на протяжении многих лет, неистовая вера в идеалы добра снискали ему всеобщее уважение. Войска под его руководством свято верят в свою удачу, как будто только одно присутствие Годрика на поле боя способно гарантировать им победу.',
            'Годрик неизменно руководствуется во всём своим чувством долга и непоколебимой верностью Империи Грифона. Его религиозная вера неоспорима настолько, что граничит с фанатизмом, но не переходит его.',
            'Старец в доспехах'
        ),
        new Card(
            'Вульфстен',
            'Вульфстен — воин гномьего клана Северного Ветра. Он силён и приучен жить в суровых условиях гор. Нужно заметить, что немногие гномы отваживаются покидать свои подземные города. Путешествия научили его дружелюбно относиться к другим народам, что покрыло его позором в глазах более консервативных членов гномьего общества. После того, как его простые высказывания и недипломатичные убеждения стали слишком часто сбивать короля с толку, его отправили на границу в качестве капитана важного гарнизона.',
            'Вульфстен силён и закалён суровой горной жизнью (а ведь немногие гномы решаются покинуть свои подземные города).\n' +
            '\n' +
            'Путешествуя по внешнему миру, он завёл дружбу с другими народами, что запятнало его репутацию в глазах гномов, наиболее ревностно чтящих старые традиции.',
            'Бородатый гном в доспехах на мамонте в доспехах'
        )

    ];
}